backend/app/controllers/api/v1/events_controller.rb

      def index
        events = Event.all
---
SELECT "events".* FROM "events"

      def show
        event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]

      def create
        user = User.find_by(name: params[:username])
        event = Event.create(name: params[:name], year: params[:year], month: params[:month], day: params[:day], time: params[:time])
        user.events << event
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Helen"], ["LIMIT", 1]]
INSERT INTO "events" ("name", "year", "month", "day", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "JOBBBBB interview"], ["year", 2019], ["month", 8], ["day", 16], ["time", 10], ["created_at", "2019-08-23 15:28:15.662512"], ["updated_at", "2019-08-23 15:28:15.662512"]]
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 71], ["created_at", "2019-08-23 15:28:15.670590"], ["updated_at", "2019-08-23 15:28:15.670590"]]

      def destroy
        event = Event.find_by(id: params[:id])
        event.delete
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 72]]

      def update
        event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]