backend/app/controllers/api/v1/user_events_controller.rb

        def index
          user_events = UserEvent.all
---
SELECT "user_events".* FROM "user_events"

        def show
          user_event = UserEvent.find_by(id: params[:id])
---
SELECT  "user_events".* FROM "user_events" WHERE "user_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]